src/cf/Catalogs/уатШаблоныТребованийКонтроляТСиВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатШаблоныТребованийКонтроляТСиВодителей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПереченьТребований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Требование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТребованияКонтроляТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатТипыЗначенийТребованийКонтроляТСиВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыЗначенийТребованийКонтроляТСиВодителей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатТребованияКонтроляТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатТребованияКонтроляТС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияТребования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыЗначенийТребованийКонтроляТСиВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.уатТипыЗначенийТребованийКонтроляТСиВодителей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатШаблоныТребованийКонтроляТСиВодителей/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.уатТребованияКонтроляТС) Тогда 
		Элементы.ФормаИзменитьВыделенные.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = Ложь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.Справочники.уатШаблоныТребованийКонтроляТСиВодителей) Тогда
		Элементы.Стандартный.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтандартныйШаблонКонтроляТС(Команда)
	СоздатьСтандартныйШаблон(1);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтандартныйШаблонМедосмотра(Команда)
	СоздатьСтандартныйШаблон(2);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СоздатьСтандартныйШаблон(ВидОсмотра)
	ДопПараметры = Новый Структура("ВидОсмотра", ВидОсмотра);
	Оповещ = Новый ОписаниеОповещения("СоздатьСтандартныйШаблонВопрос", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = СтрШаблон("Создаваемый шаблон будет заполнен стандартными требованиями "
		+ "к предрейсовому/послерейсовому %1 согласно законодательства РФ, "
		+ "при этом отсутствующие требования будут добавлены в справочник.
		|Продолжить?", ?(ВидОсмотра = 1, "контролю ТС", "медосмотру водителей"));
		
	ПоказатьВопрос(Оповещ, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтандартныйШаблонВопрос(Рез, ДопПараметры) Экспорт
	Если Рез <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	мсвТребований = СоздатьСтандартныеТребования(ДопПараметры.ВидОсмотра);
	
	ПараметрыФормы = Новый Структура("мсвТребований", мсвТребований);
	ОткрытьФорму("Справочник.уатШаблоныТребованийКонтроляТСиВодителей.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьСтандартныеТребования(ВидОсмотра)
	мсвТребований = Новый Массив;
	
	Если ВидОсмотра = 1 Тогда
		ИмяМакета = "ПереченьОбязательныхТребованийКонтроляТС";
	Иначе
		ИмяМакета = "ПереченьОбязательныхТребованийМедосмотра";
	КонецЕсли;
	МакетТребований = Справочники.уатШаблоныТребованийКонтроляТСиВодителей.ПолучитьМакет(ИмяМакета);
	
	ОбластьДанных = МакетТребований.ПолучитьОбласть("Строки|Колонки");
	Для Сч = 1 По ОбластьДанных.ВысотаТаблицы Цикл
		НаименованиеТребования      = ОбластьДанных.Область(Сч, 1, Сч, 1).Текст;
		ОписаниеТребования          = ОбластьДанных.Область(Сч, 2, Сч, 2).Текст;
		ТипЗначенийТребованияСтрока = ОбластьДанных.Область(Сч, 3, Сч, 3).Текст;
		
		Если ТипЗначенийТребованияСтрока = "Булево" Тогда
			ТипЗначенийТребования = Перечисления.уатТипыЗначенийТребованийКонтроляТСиВодителей.Булево;
		ИначеЕсли ТипЗначенийТребованияСтрока = "Число" Тогда
			ТипЗначенийТребования = Перечисления.уатТипыЗначенийТребованийКонтроляТСиВодителей.Число;
		Иначе
			ТипЗначенийТребования = Перечисления.уатТипыЗначенийТребованийКонтроляТСиВодителей.Строка;
		КонецЕсли;
		
		ТребованиеСсылка = Справочники.уатТребованияКонтроляТС.НайтиПоНаименованию(НаименованиеТребования);
		Если НЕ ЗначениеЗаполнено(ТребованиеСсылка) Тогда
			НовоеТребование = Справочники.уатТребованияКонтроляТС.СоздатьЭлемент();
			НовоеТребование.Наименование = НаименованиеТребования;
			НовоеТребование.Содержание = ОписаниеТребования;
			НовоеТребование.ТипЗначенияТребования = ТипЗначенийТребования;
			НовоеТребование.Записать();
			ТребованиеСсылка = НовоеТребование.Ссылка;
		КонецЕсли;
		
		мсвТребований.Добавить(ТребованиеСсылка);
	КонецЦикла;
	
	Возврат мсвТребований;
КонецФункции

#КонецОбласти
